Revit 2026 API

# ExportFontTableGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportFontKey, ExportFontInfo))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<ExportFontKey^, ExportFontInfo^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
```

#### Return Value

IEnumeratorKeyValuePairExportFontKey, ExportFontInfoAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ExportFontTable Class

Autodesk.Revit.DB Namespace